[
  {
    "photo": "mary.png",
    "name": "Mary Ellen Randall",
    "affiliation": "2025 IEEE President-Elect | IEEE Fellow",
    "title": "",
    "abstract": "Mary Ellen Randall is an IEEE Fellow and IEEE-Eta Kappa Nu member with extensive IBM experience spanning hardware/software development, digital video chips, client/server services, network management, operating systems, test design automation, and international assignments. <p>She managed large international projects and served in top IEEE roles, including Treasurer, Vice President of Member and Geographic Activities, Region 3 Director, and IEEE Women in Engineering Committee Chair. <p>She founded the IEEE MOVE International Community Outreach Program for disaster relief and STEM education and received major recognition, including the IEEE Haraden Pratt Award."
  },
  {
    "photo": "bala.png",
    "name": "Bala Prasanna",
    "affiliation": "IEEE Region 1 Director",
    "title": "",
    "abstract": "Mr Bala Prasanna’s professional career of over 35 years includes working in institutions like SUNY-State University of New York,  AT&T and IBM in various roles in senior technical and management positions. <p>He volunteers his time at IEEE- Region 1 as a member of Board of Governors. <p>He has also served as a board member at IEEE-USA during 2016-17.  <p>Mr. Prasanna is a proud to be a member of IEEE HKN Honor Society ."
  },
  {
    "photo": "Subodha_Charles.jpg",
    "name": "Subodha Charles",
    "affiliation": "IEEE Student Activities Committee Chair",
    "title": "From Student to Professional: Keeping the University Link Alive",
    "abstract": "Subodha Charles is a faculty member at the Department of Electronic and Telecommunication Engineering, University of Moratuwa, Sri Lanka. He received his Ph.D. in Computer Science from the University of Florida, USA, and his B.Sc. specializing in Electronics and Telecommunication Engineering from the University of Moratuwa, Sri Lanka. His research interests include hardware security and trust, embedded systems and computer architecture. Subodha co-founded a company in Sri Lanka operating in the energy sector in 2013, and it is currently one of the country's market leaders. The company has invested and expanded into other areas such as construction, digital solutions, and healthcare, and is now operating as a group of companies - “Pearl Cluster”. He has volunteered at IEEE (Institute of Electrical and Electronics Engineers) since 2011 and has held several global leadership positions. He has successfully led many initiatives within IEEE to foster entrepreneurship, industry collaboration, and membership growth. Several international awards within IEEE have recognized his efforts. Currently, he serves as the Chair of the IEEE MGA Student Activities Committee."
  },
  {
    "photo": "alberto.png",
    "name": "Alberto Tam Yong",
    "affiliation": "Senior Electrical Engineer | Vice Chair, IEEE Young Professionals Committee",
    "title": "IEEE Young Professionals",
    "abstract": "Alberto Tam Yong is a Senior Electrical Engineer at Applied Medical in Rancho Santa Margarita, CA, innovating in the Technology and Development, Electrical, team to advance medical devices for minimally invasive surgery. He has experience in the design, prototype, and development of hardware electrical systems, and specializes in analog and digital circuit design. He received his BSc in Electrical Engineering from the University of California, Riverside, in 2016. He started volunteering for IEEE as the 2015-2016 Chair of the IEEE Student Branch at the University of California, Riverside, and has continued to volunteer for IEEE at the local Section, Regional, and global level. Currently, Alberto Tam Yong is a Vice Chair of the IEEE Young Professionals Committee, Chair of the IEEE Region 6 Regional Student Activities Committee (RSAC), Past Chair of IEEE Region 6 Young Professionals Committee, Chair of the IEEE Orange County Section, an organizing committee member for the IEEE Rising Stars Conference, a member of the IEEE OneIEEE for Students AdHoc Committee, and a member of the IEEE in 2050 and Beyond AdHoc Committee."
  },
  {
    "photo": "phanemane.png",
    "name": "Phane Mane",
    "affiliation": "Global Lead - AI Product Strategy/Delivery at Boston Scientific",
    "title": "The AI Career Playbook: Where to Start, What to Learn, and How to Grow",
    "abstract": "This session will guide you through the essentials of starting your journey in AI, focusing on selecting the right concepts and skills to learn first, from foundational mathematics and cloud-based tools to practical approaches for building small projects. <p>You'll learn how to choose your specialized focus—whether it’s data analysis, computer vision, or natural language processing—and discover ways to accelerate your growth by sharing code online and tackling real-world problems."
  },
  {
    "photo": "micky.png",
    "name": "Micky Chhabda",
    "affiliation": "Analytics Manager | TEDx Speaker | IEEE Senior Member",
    "title": "AI and Analytics: Sustainable AI Through Data Storytelling",
    "abstract": "Analytics explains what happened, AI forecasts what’s likely next and surfaces early signals, and storytelling links the two—turning complex findings into clear narratives that drive action. <p>In this session, Micky Chhabda uses real examples to show how to transform static dashboards into C-suite-ready stories by fusing AI-driven analytics with engineering principles and human-centric storytelling, enabling precise, reliable, and sustainable decisions in engineering and marketing."
  },
  {
    "photo": "stephanie.png",
    "name": "Stephanie Gillespie",
    "affiliation": "Associate Dean, Tagliatela College of Engineering at the University of New Haven | Chair, IEEE Humanitarian Technologies Education Committee",
    "title": "Get connected: How HTB can help you make an impact",
    "abstract": "The IEEE Humanitarian Technologies Board (HTB) inspires and empowers IEEE volunteers around the world carrying out and supporting impactful humanitarian technology activities at the local level. <p>Learn more about the HTB programs and opportunities, and then dive into an interactive session where you will identify local challenges in your community that you can help solve. <p>Learn best tips on connecting with communities, and start to prepare your pitch for later in the workshop"
  },
  {
    "photo": "eddyvertill.png",
    "name": "Dr. Eddy Vertill",
    "affiliation": "Seasoned Management Consultant | Professor, Rutgers University & Alvernia University",
    "title": "",
    "abstract": "Introduction to PMI certifications."
  },
  {
    "photo": "frank.png",
    "name": "Frank Saladis",
    "affiliation": "Author | PMP | PMI Fellow | Founder, Blue Marble Enterprizes Inc.",
    "title": "",
    "abstract": "Introduction to PMI certifications."
  },
  {
    "photo": "ahsan.png",
    "name": "Ahsan Qamer Sheikh",
    "affiliation": "Chair, IEEE Young Professionals Germany",
    "title": "",
    "abstract": "Panelist for panel discussion - What works with YP engagement."
  },
  {
    "photo": "sam_stone.jpeg",
    "name": "Sam Stone",
    "affiliation": "AI/ML Engineer at Lockheed Martin| IEEE Region 1 Young Professionals Chair",
    "title": "IEEE Regions 1+2 Young Professionals",
    "abstract": "Sam Stone is an Artificial Intelligence Engineer at Lockheed Martin, specializing in radar signal processing. Sam has a BS in Electrical Engineering from Binghamton University and has several publications related to signal processing, autonomous vehicles, deep learning, large language models, and radar. Sam has been an active member of the IEEE for 10 years and is currently the IEEE Region 1 Young Professionals Chair and the IEEE Syracuse Section Treasurer."
  }
]
